Ran Plan for dir: `svc-cluster1` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=985539781206]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_eks_access_entry.admin_access_entry1 will be created
+ resource "aws_eks_access_entry" "admin_access_entry1" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "svc-cluster1"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::985539781206:user/infra_user"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.admin_policy1 will be created
+ resource "aws_eks_access_policy_association" "admin_policy1" {
      + associated_at = (known after apply)
      + cluster_name  = "svc-cluster1"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::985539781206:user/infra_user"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_addon.coredns will be created
+ resource "aws_eks_addon" "coredns" {
      + addon_name           = "coredns"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "svc-cluster1"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_eks_addon.ebs_csi will be created
+ resource "aws_eks_addon" "ebs_csi" {
      + addon_name           = "aws-ebs-csi-driver"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "svc-cluster1"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_eks_addon.kube_proxy will be created
+ resource "aws_eks_addon" "kube_proxy" {
      + addon_name           = "kube-proxy"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "svc-cluster1"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_eks_addon.vpc_cni will be created
+ resource "aws_eks_addon" "vpc_cni" {
      + addon_name           = "vpc-cni"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "svc-cluster1"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_eks_cluster.svc_cluster1 will be created
+ resource "aws_eks_cluster" "svc_cluster1" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "svc-cluster1"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = "1.33"

      + access_config {
          + authentication_mode = "API"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "68.100.77.52/32",
            ]
          + subnet_ids                = [
              + "subnet-030af28799a9b7fe5",
              + "subnet-0710690d90c6d77ff ",
              + "subnet-0ea4f9d43e57530ed",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.svc_cluster1_nodes will be created
+ resource "aws_eks_node_group" "svc_cluster1_nodes" {
      + ami_type               = "AL2_ARM_64"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "svc-cluster1"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t4g.medium",
        ]
      + node_group_name        = "svc_cluster1_nodes"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-030af28799a9b7fe5",
          + "subnet-0710690d90c6d77ff ",
          + "subnet-0ea4f9d43e57530ed",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config (known after apply)
    }

  # aws_iam_role.cluster_role will be created
+ resource "aws_iam_role" "cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                          + "sts:TagSession",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-svc-cluster1-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.node_role will be created
+ resource "aws_iam_role" "node_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-svc-cluster1-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created
+ resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-svc-cluster1-role"
    }

  # aws_iam_role_policy_attachment.example-AmazonEBSCSIDriverPolicy will be created
+ resource "aws_iam_role_policy_attachment" "example-AmazonEBSCSIDriverPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "eks-svc-cluster1-node-group-role"
    }

  # aws_iam_role_policy_attachment.example-AmazonEC2ContainerRegistryReadOnly will be created
+ resource "aws_iam_role_policy_attachment" "example-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-svc-cluster1-node-group-role"
    }

  # aws_iam_role_policy_attachment.example-AmazonEKSWorkerNodePolicy will be created
+ resource "aws_iam_role_policy_attachment" "example-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-svc-cluster1-node-group-role"
    }

  # aws_iam_role_policy_attachment.example-AmazonEKS_CNI_Policy will be created
+ resource "aws_iam_role_policy_attachment" "example-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-svc-cluster1-node-group-role"
    }

  # aws_security_group.eks_cluster_sg will be created
+ resource "aws_security_group" "eks_cluster_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "Allow all traffic from private VPC range"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "svc-cluster1-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "svc-cluster1-sg"
        }
      + tags_all               = {
          + "Name" = "svc-cluster1-sg"
        }
      + vpc_id                 = "vpc-0df13ab5c2a1d8f36"
    }

  # aws_security_group_rule.allow_internal_all_ports_to_control_plane will be created
+ resource "aws_security_group_rule" "allow_internal_all_ports_to_control_plane" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
        ]
      + description              = "Allow all traffic from internal VPC to EKS control plane"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

Plan: 17 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d svc-cluster1
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-74fd7c45b6-kd49t:4141/lock?id=mr26%252Fplatform-sre-devops-lab%252Fsvc-cluster1%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d svc-cluster1
  ```
Plan: 17 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```